{
  "about": "About",
  "about2": "",
  "aboutme1": "Hi! I'm Kama, a Front-End Developer located in Taiwan. I have a serious passion for UI effects, animations and creating intuitive, dynamic user experiences, and really enjoyed the continual learning that comes with coding.",
  "aboutme2": "My main experience is in front-end development but I also have a passion for design. Given that producing a modern website requires the combination of design, server technology, and the layer that users interacts with. I believe having experience in both design and development allows for making the most optimal user experiences.\n\nGraduated from Computer Science and Information Engineering. During the school period, the main research field is the field of artificial intelligence (AI). My graduation project is to train AI algorithms to analyze different types of data and generate AI models and natural language processing (NLP) data crawlers, classification, various algorithms, etc. to combine web page presentation. As for the web page, use self-taught HTML, CSS, Javascript API serialization and interaction, and ASP.net to build and maintain, and develop App combined with web pages and additionally produced small games in App.\n\nDuring the production of web pages, my interest in creating a good experience for users and making various layout constructions and UI animations gradually grew, until I eventually decided to take my leap of faith! Decided to become a front-end engineer, keep learning and focus on fast, elegant and accessible user experiences.\n\nBy the way → I'm a chatterbox sometimes. :(",
  "aboutme3": "In terms of my work experience, I've had the privilege of holding positions as a Front-End Engineer. These experiences have given me a profound understanding of the significance of web interfaces in user experience. I've been responsible for developing and designing the front-end aspects of websites, ensuring interactive interfaces and visual appeal.\n\nI enjoy collaborating with UI/UX designers to translate their designs into actual front-end implementations. I utilize fundamental skills such as HTML, CSS, native JavaScript, and jQuery. I'm also proficient in frameworks like ReactJS and Vue.js, streamlining code structure and enhancing user experience.\n\nI also engage in discussions with the backend team to reduce loading times, improve performance, and most importantly, enhance security through front-end and back-end measures.\n\nIn previous projects, I've optimized web performance to ensure fast loading and smooth operation of pages. I've also been involved in resolving cross-browser compatibility issues to ensure consistency across various browsers.\n\nIn my first job, I was responsible for two projects during my tenure: an event exhibition platform and a platform similar to Instagram.\n\nIn my second job, I participated in the development and research of the front-end interface for a Warehouse Management System (WMS), collaborating closely with the team. During this period, we successfully accelerated the progress of the company's projects, redeveloping what the previous team had taken over 3 years to complete within just 6 months.\n\nThis experience provided me with a deeper understanding of the complexity of WMS systems and effective collaboration. I worked closely with team members to discuss system requirements, carry out design, and development. Alongside another front-end developer, I was responsible for creating the front-end interface, ensuring users could easily navigate the system and have a seamless user experience.\n\nRather than just making modifications to the existing foundation, we reimagined and redesigned the system to better meet the requirements. Through optimizing system architecture and employing more efficient technologies and tools, we reorganized the code for maintainability. As a result, we managed to shorten the project timeline to one-sixth of the original plan.\n\nOne crucial lesson I learned from this project is that effective teamwork and focus on the goal can yield unexpected results. I am honored to have been part of such a challenging project and to apply what I've learned in real-world contexts.\n\nI am currently focused on web front-end technologies and plan to continue enhancing both front-end and back-end skills, aiming to become a full-stack engineer. I am ready to leverage my expertise and experience to help solve problems for the company.\n\nThank you for taking the time to review my resume. If you are currently seeking candidates for relevant positions, please consider hiring me. I hope to join your esteemed company and contribute to a brighter future together.",
  "aboutsite1": "The content of the website blog is mainly to record some BUGs encountered, places and skills that are not understood, and most of them are notes rather than teaching.\n                        \nMy understanding is biased toward a practitioner rather than a theorist.\nIt would be very inefficient for me if I was going to learn a new technology purely for the sake of \"learning\".\n\nAccumulate all kinds of experience in the process of practice, and learn by yourself step by step by reading books and checking information on the Internet. You can learn a lot by building your own website without relying on any templates, and you will feel a sense of fulfillment and accomplishment. It feels like you built your own world with your own hands.\n",
  "aboutsite2": "The writing of this site is purely a personal hobby, and the front and back ends are independently completed. It is mainly used to record notes on work, life, and study.",
  "aboutsite3": "Explanation",
  "aboutsite4": "For the compatibility issues currently tested, all mainstream browser kernels are compatible.",
  "aboutwork-1": "Works on",
  "aboutwork-2": "",
  "agreement": "Agreement",
  "all": "All",
  "article": "Articles",
  "author": "Author",
  "category": "Category",
  "cc0-1": "Attribution-NonCommercial 4.0 International ",
  "cc0-2": "en",
  "colours": "Matching colors",
  "daily": "Daily",
  "date": "Date",
  "demo": "DEMO",
  "description": "Description",
  "display": "Display",
  "drawing": "Drawing",
  "endpage": "This is already the latest article :)",
  "frontend": "Front End",
  "goback": "Go back",
  "home": "Home ",
  "indexmd": "Kama's Blog mainly records the trifles and technologies used in daily life and work, as well as some resource records used ◝(⁰ ▿⁰)◜.",
  "justnow": "Just now",
  "languagelearning": "Language",
  "learneng": "Learning English",
  "localeSetting": "en",
  "log": "Update",
  "minread": "min read",
  "nextpage": "Next",
  "nonesamtc1": "Your search \"",
  "nonesamtc10": "",
  "nonesamtc2": "\" did not match any articles. Search suggestions:",
  "nonesamtc3": "Make sure all words are spelled correctly.",
  "nonesamtc4": "Try different keywords.",
  "nonesamtc5": "Try more general keywords.",
  "nonesamtc6": "Or you just want to see this sentence ...",
  "nonesamtc7": "",
  "nonesamtc8": "",
  "nonesamtc9": "",
  "noresultsmtcq": "No results match that query !!!",
  "notes": "Notes",
  "noticeArr1": "New Page Unveiled! Explore the world with our stunning 3D Earth showcase, all at your fingertips.",
  "noticeArr2": "The search function on the top right allows you to easily search and quickly find the information you need with just one click!",
  "noticeArr3": "Easily track website traffic, understand website trends, and user preferences!",
  "noticeArr4": "Reclassify into \"daily\" and \"language learning\" for a more organized and fulfilling life! ",
  "noticeArr5": "Share your thoughts! The newly established message system is waiting for you to explore!",
  "noticeArr6": "The \"Read More Related Posts\" feature added below the post takes you through a more diverse and rich world!",
  "nuxtcontent": "@nuxt/content",
  "onlineresource": "Online Resources",
  "onlinetool": "Online Tools",
  "other": "Other",
  "portfolio": "Portfolio",
  "previouspage": "Previous",
  "profilecardsocial": "Buttons only work for GitHub / Codepen / Discord / Mail, other buttons purely make the UI look fleshed out. ",
  "rangea": "All (Including Content)",
  "ranged": "Description only",
  "ranget": "Title only",
  "ranget+d": "Title + Description",
  "readmore": "Read more",
  "regularexpressions": "RegEx",
  "releasedin": "Released",
  "resource": "Resource",
  "resourcedescription": "A variety of useful online resources.",
  "search": "Search",
  "searchrange": "Search range",
  "searchresultsforDN": "",
  "searchresultsforUP": "Search results for",
  "slicing": "Slicing (interface design)",
  "startpage": "This is the starting point, no more articles before this...",
  "tags": "Tags",
  "tagss-1": "Here's a list of all my blog portfolios with the \"",
  "tagss-2": "\" tag.",
  "tagss-3": "Here's a list of all my blog portfolios.",
  "taibunsai": "Poem in Taiwanese Hokkien Vernacular",
  "tech": "Tech",
  "timedd": " days ago",
  "timehh": " hours ago",
  "timemin": " minutes ago",
  "timemm": " months ago",
  "times": "times",
  "timeyy": " years ago",
  "title": "Title",
  "totalofarticlesDN": "articles in total.",
  "totalofarticlesUP": "There are",
  "typeios": "IOS",
  "typepractice": "Practice",
  "typeweb": "Webpage",
  "typewebnn": "Webpage (non-functional)",
  "updatedin": "Modified",
  "visitorcount": "Visitors",
  "visits": "Viewed",
  "vscodeextensions": "VS Code extensions",
  "word": "Words",
  "work": "Portfolio",
  "work2": "Works",
  "world": "World"
}
