{
  "about": "約",
  "about2": "",
  "aboutme1": "【私について】\n台湾在住のフロントエンド開発者のカーマです。 UI エフェクト、アニメーション、直感的で動的なユーザー エクスペリエンスの作成に強い情熱を持っており、コーディングに伴う継続的な学習を本当に楽しんでいます。",
  "aboutme2": "【学業経歴】\n大学在学中、平日には積極的に教授や同級生とさまざまな業務を手伝ったり、セミナーの開催などを行ったりする機会がありました。また、産学協力のプロジェクトにも参加し、直属ではない教授のアシスタントも務めました。学業の面では、キャンパス内でトップ3に入る成績を収め、さまざまなプログラミング言語のコースを積極的に修了し、優れた成績を収めました。\n\n卒業研究は、異なるタイプのデータを分析し、AIモデルを生成するAIアルゴリズムのトレーニングや、自然言語処理（NLP）を用いたデータクローリング、分類、様々なアルゴリズムの実装などを行うものでした。さらに、MS SQLを活用してウェブページ上でデータを表示する仕組みを組み合わせました。\n\nウェブページの面では、独学でHTML、CSS、Javascript APIのシリアル化と相互作用を学び、ASP.Netを用いてウェブページの構築とメンテナンスを行いました。また、ウェブページと連携するアプリの開発も行い、そのアプリ内に関連する小さなゲームも組み込みました。\n\nウェブ制作の過程で、ユーザーに良い体験を提供することや、様々なレイアウト構造やUIアニメーションを作成することへの興味が次第に高まりました。その結果、最終的にフロントエンドエンジニアとしての道を選び、ユーザー体験を迅速で洗練されたものにし、容易にアクセスできるように専念する決意をしました。",
  "aboutme3": "\n【職務経歴】\n前端エンジニアの職に就く幸運に恵まれました。これらの経験から、ウェブインターフェースがユーザーエクスペリエンスに与える重要性を深く理解しています。ウェブサイトのフロントエンド部分の開発とデザインを担当し、インタラクティブ性と視覚的魅力を確保しました。\n\nUI/UXデザイナーと協力して、彼らのデザインを実際のフロントエンド実装に落とし込むのが好きです。HTML、CSS、ネイティブJS、jQueryなどの基本的なスキルを使用するだけでなく、ReactJSやVue.jsなどのフレームワークも使用し、コード構造をシンプルにし、ユーザーエクスペリエンスを向上させています。\n\nまた、バックエンドチームと連携して読み込み時間の短縮、パフォーマンスの向上、そして何よりもセキュリティの前後端防御について議論します。\n\n過去のプロジェクトでは、ウェブパフォーマンスを最適化してページの高速読み込みとスムーズな動作を確保しました。また、クロスブラウザの互換性の問題の解決にも参加し、さまざまなブラウザでの一貫性を確保しました。\n\n初めての職では、在職中に2つのプロジェクトを担当し、APIの連携やカスタムプロジェクトのメンテナンスと開発に参加しました。バックエンドエンジニアやUI/UXデザイナーと協力して、企画要件に最適化と改善を行いました。また、クロスプラットフォームのレスポンシブウェブデザイン（RWD）の開発も含まれ、ユーザーがどのデバイスでもスムーズに閲覧し、最適なユーザーエクスペリエンスを享受できるようにしました。プロジェクト管理とチームのGitバージョン制御にはSourcetreeを使用し、同僚との技術共有にも熱心に取り組み、開発効率の向上に貢献しました。\n\n2番目の職では、WMS（倉庫管理システム）のフロントエンドインターフェースの開発と研究に参加し、チームと協力して取り組みました。この期間中、会社のプロジェクトスケジュールを大幅に前倒しし、元々3年以上かかっていたプロジェクトを6か月で再構築しました。\n\nこの経験により、WMSシステムの複雑さと効果的な協力方法をより深く理解しました。チームメンバーと緊密に連携し、システム要件を議論し、設計と開発を行いました。もう一人のフロントエンドエンジニアと共に、ユーザーがシステムを簡単に操作できるようにし、スムーズなユーザーエクスペリエンスを実現しました。\n\n単に既存の基盤を修正するだけでなく、システムを新たに設計し直し、要求をより良く満たすように再構築しました。システムアーキテクチャの最適化や効率的なテクノロジーやツールの採用により、元のコードも整理され、プロジェクト全体の期間を元の計画の1/6に短縮することに成功しました。\n\nこのプロジェクトは、効果的なチーム協力と目標への集中が予想外の成果をもたらすことを教えてくれました。このような挑戦的なプロジェクトに参加できたことを光栄に思い、学んだことを実際の状況に適用できました。\n\n現在はウェブフロントエンド技術に注力し、将来はバックエンドとフロントエンドのスキルを向上させ、フルスタックエンジニアになるため努力しています。私は専門知識と経験を活かして、企業の問題解決に貢献できると確信しています。\n\n私の履歴書をお読みいただき、ありがとうございました。もしご企業が関連する人材を探している場合、ぜひ私を検討していただければ幸いです。貴社のチームに参加し、共に素晴らしい未来を築くことを楽しみにしています。",
  "aboutsite1": "ウェブサイトのブログの内容は、遭遇したいくつかのバグ、わからない場所、スキルを記録することが主であり、それらのほとんどは教えるというよりメモです。\n                        \n私の理解は、理論家というよりも実務家に偏っています。\n純粋に「学ぶ」ためだけに新しい技術を学ぶのは、私にとって非常に非効率的です。\n\n実践の過程であらゆる経験を積み、本を読んだりインターネットで情報を調べたりしながら、一歩一歩自分で学んでいきます。 テンプレートに頼らず、自分だけのホームページを作ることで多くのことを学ぶことができ、充実感と達成感を味わうことができます。 自分の手で自分の世界を作ったような感覚です。",
  "aboutsite2": "このサイトの執筆は純粋に個人的な趣味であり、フロントエンドとバックエンドは独立して完成されています。 主に、仕事、生活、勉強などのメモを記録するために使用されます。",
  "aboutsite3": "説明",
  "aboutsite4": "現在テストされている互換性の問題については、主流のブラウザ カーネルはすべて互換性があります。",
  "aboutwork-1": "",
  "aboutwork-2": "に関する作品",
  "agreement": "使用許諾契約",
  "all": "全て",
  "article": "ぶんしょう",
  "author": "筆者",
  "category": "カテゴリー",
  "cc0-1": "表示 - 非営利 4.0 国際",
  "cc0-2": "ja",
  "colours": "色合わせ",
  "daily": "日々の生活",
  "date": "日にち",
  "demo": "Demo",
  "description": "説明",
  "display": "見せる",
  "drawing": "絵画（かいが）",
  "endpage": "この記事はすでに最新です...",
  "frontend": "フロントエンド",
  "goback": "戻る",
  "home": "ホームページ",
  "indexmd": "Kama's Blog は日常生活や仕事で使っている些細なことや技術、使ったリソースの記録を中心に◝(⁰ ▿⁰)◜.",
  "justnow": "ちょうど今",
  "languagelearning": "言語学習",
  "learneng": "英語を学ぶ",
  "localeSetting": "ja",
  "log": "更新ログ",
  "minread": "分で読めます",
  "nextpage": "次のページ",
  "nonesamtc1": "検索「",
  "nonesamtc10": "件の結果です。",
  "nonesamtc2": "」に一致する記事はありませんでした。 検索候補:",
  "nonesamtc3": "すべての単語のスペルが正しいことを確認してください。",
  "nonesamtc4": "さまざまなキーワードを試してください。",
  "nonesamtc5": "より一般的なキーワードを試してください。",
  "nonesamtc6": "または、この文が見たいだけです ...",
  "nonesamtc7": "以下は「",
  "nonesamtc8": "」で検索した",
  "nonesamtc9": "件中",
  "noresultsmtcq": "そのクエリに一致する結果はありません !!!",
  "notes": "ノート",
  "noticeArr1": "新しいページが登場！スタンニングな3D地球で世界中を探索しよう、すべてが指先に。",
  "noticeArr2": "右上の検索機能で、簡単に検索して必要な情報をすぐに見つけることができます！",
  "noticeArr3": "問者数の追跡が簡単になり、ウェブサイトの動向とユーザーの嗜好が把握できます！",
  "noticeArr4": "「日常」と「言語学習」に再分類して、より整理された充実した生活を！ウェブサイト訪",
  "noticeArr5": "あなたの考えを共有しましょう！新しく作成されたメッセージシステムは、あなたが探求するために待っています！",
  "noticeArr6": "投稿の下に追加された「関連投稿をもっと見る」機能で、より多様で豊かな世界を歩いてみましょう！",
  "nuxtcontent": "@nuxt/content",
  "onlineresource": "オンライン・リソース",
  "onlinetool": "オンライン・ツール",
  "other": "他の",
  "portfolio": "さくひんしゅう",
  "previouspage": "前のページ",
  "profilecardsocial": "ボタンは Github / Codepen / Discord / Mail でのみ機能し、他のボタンは純粋に UI を肉付けしたものにします。",
  "rangea": "全て（記事内容含む）",
  "ranged": "説明のみ",
  "ranget": "タイトルのみ",
  "ranget+d": "タイトル + 説明",
  "readmore": "続きを読む",
  "regularexpressions": "正規表現",
  "releasedin": "作成日",
  "resource": "リソース",
  "resourcedescription": "さまざまな便利なオンライン リソース。",
  "search": "探す",
  "searchrange": "検索範囲",
  "searchresultsforDN": "の検索結果",
  "searchresultsforUP": "",
  "slicing": "Slicing",
  "startpage": "これは出発点です。これより前の記事はありません!! TAT",
  "tags": "タグ",
  "tagss-1": "これは、「",
  "tagss-2": "」タグが付いたすべてのブログ ポートフォリオのリストです。",
  "tagss-3": "これが私のすべてのブログポートフォリオのリストです。",
  "taibunsai": "ミンナン語白話文の詩",
  "tech": "ブログ",
  "timedd": "日前",
  "timehh": "時間前",
  "timemin": "分前",
  "timemm": "ヶ月前",
  "times": "回の訪問",
  "timeyy": "年前",
  "title": "題名",
  "totalofarticlesDN": "記事あります。",
  "totalofarticlesUP": "全部で",
  "typeios": "IOS",
  "typepractice": "練習",
  "typeweb": "ウェブページ",
  "typewebnn": "ウェブページ (機能しない)",
  "updatedin": "更新日",
  "visitorcount": "訪問者数",
  "visits": "合計",
  "vscodeextensions": "VS Code 拡張機能",
  "word": "ワード",
  "work": "さくひんしゅう",
  "work2": "作品",
  "world": "世界"
}
